"""
Вам дано описание наследования классов исключений в следующем формате.
<имя исключения 1> : <имя исключения 2> <имя исключения 3> ... <имя исключения k>
Это означает, что исключение 1 наследуется от исключения 2, исключения 3, и т. д.
Антон написал код, который выглядит следующим образом.
try:
   foo()
except <имя 1>:
   print("<имя 1>")
except <имя 2>:
   print("<имя 2>")
...
Костя посмотрел на этот код и указал Антону на то, что некоторые исключения можно не ловить, так как ранее в коде будет
пойман их предок. Но Антон не помнит какие исключения наследуются от каких. Помогите ему выйти из неловкого положения и
напишите программу, которая будет определять обработку каких исключений можно удалить из кода.
Формат входных данных
В первой строке входных данных содержится целое число n - число классов исключений.
В следующих n строках содержится описание наследования классов. В i-й строке указано от каких классов наследуется i-й класс.
Обратите внимание, что класс может ни от кого не наследоваться. Гарантируется, что класс не наследуется сам от себя (прямо или
косвенно), что класс не наследуется явно от одного класса более одного раза.
В следующей строке содержится число m - количество обрабатываемых исключений.
Следующие m строк содержат имена исключений в том порядке, в каком они были написаны у Антона в коде.
Гарантируется, что никакое исключение не обрабатывается дважды.
Формат выходных данных
Выведите в отдельной строке имя каждого исключения, обработку которого можно удалить из кода, не изменив при этом поведение
программы. Имена следует выводить в том же порядке, в котором они идут во входных данных.
"""

n = int(input())
b = {}
for i in range(n):
    a = input().split()
    l = len(a)
    if ':' in a:
        while a[l-1] != ':':
            if a[l-1] in b.keys():
                b[a[l-1]].append(a[0])
            else:
                b.update({a[l-1]: [a[0]]})
            l -= 1
for key in b.keys():
	for i in b[key]:
		if str(i) in b.keys():
			for j in b[i]:
				b[key].append(j)
m = int(input())
r, t, o = [], [], []
for i in range(m):
    s = input()
    r.append(s)
    for key in b:
        if key in r and s not in t:
            if s in b[key] and r.index(key) < r.index(s):
                o.append(s)
                t.append(s)
for i in o:
    print(i)