"""Напишите программу, которая принимает на стандартный вход список игр футбольных команд с результатом матча и выводит настандартный вывод сводную таблицу результатов всех матчей.За победу команде начисляется 3 очка, за поражение — 0, за ничью — 1.Формат ввода следующий:В первой строке указано целое число n — количество завершенных игр.После этого идет n строк, в которых записаны результаты игры в следующем формате:Первая_команда;Забито_первой_командой;Вторая_команда;Забито_второй_командойВывод программы необходимо оформить следующим образом:Команда:Всего_игр Побед Ничьих Поражений Всего_очков"""n = int(input())dict = {}for i in range(n):    a = input().split(";")    if a[0] not in dict:        dict.update({a[0]: [0, 0, 0, 0]})    if a[2] not in dict:        dict.update({a[2]: [0, 0, 0, 0]})    if a[2] in dict and a[0] in dict:        if int(a[1]) > int(a[3]):            dict[a[0]][0] += 1            dict[a[2]][2] += 1        elif int(a[3]) > int(a[1]):            dict[a[0]][2] += 1            dict[a[2]][0] += 1        elif int(a[3]) == int(a[1]):            dict[a[0]][1] += 1            dict[a[2]][1] += 1        dict[a[0]][3] += 1        dict[a[2]][3] += 1for key, value in dict.items():    print(key, dict[key][3], dict[key][0], dict[key][1], dict[key][2], 3*dict[key][0] + dict[key][1] + 0*dict[key][2])